## Experiment on humanresources scheme

### Connect to the database

In [56]:
%run connection.ipynb

Connecting with connection string : postgresql://postgres:letmein@db:5432/Adventureworks
 * postgresql://postgres:***@db:5432/Adventureworks
1 rows affected.
 * postgresql://postgres:***@db:5432/Adventureworks
1 rows affected.
 * postgresql://postgres:***@db:5432/Adventureworks
68 rows affected.

### Create base materializewd view

In [57]:
%%sql

DROP MATERIALIZED VIEW IF EXISTS humanresources.deparment_name_and_groups;

CREATE MATERIALIZED VIEW humanresources.deparment_name_and_groups AS (
    SELECT
        e.businessentityid,
        e.jobtitle,
        d.departmentid,
        d.name AS deparment_name,
        d.groupname AS deparment_group_name

    FROM
        humanresources.employee e
        INNER JOIN humanresources.employeedepartmenthistory edh ON edh.businessentityid = e.businessentityid
        INNER JOIN humanresources.department d ON d.departmentid = edh.departmentid

    ORDER BY 1
)

 * postgresql://postgres:***@db:5432/Adventureworks
Done.
296 rows affected.

Empty DataFrame
Columns: []
Index: []

### What are the departmant names in the there?

In [59]:
%%sql 

SELECT t.* FROM (
    SELECT
        bt.deparment_name,
        row_number() OVER(partition BY bt.deparment_name ORDER BY bt.businessentityid) AS row_number
    FROM humanresources.deparment_name_and_groups bt
) t WHERE t.row_number = 1

 * postgresql://postgres:***@db:5432/Adventureworks
16 rows affected.

                deparment_name  row_number
0             Document Control           1
1                  Engineering           1
2                    Executive           1
3   Facilities and Maintenance           1
4                      Finance           1
5              Human Resources           1
6         Information Services           1
7                    Marketing           1
8                   Production           1
9           Production Control           1
10                  Purchasing           1
11           Quality Assurance           1
12    Research and Development           1
13                       Sales           1
14      Shipping and Receiving           1
15                 Tool Design           1

### What are the main departmant group names in the there?

In [61]:
%%sql 

SELECT t.* FROM (
    SELECT
        bt.deparment_group_name,
        row_number() OVER(partition BY bt.deparment_group_name ORDER BY bt.businessentityid) AS row_number
    FROM humanresources.deparment_name_and_groups bt
) t WHERE t.row_number = 1

 * postgresql://postgres:***@db:5432/Adventureworks
6 rows affected.

                   deparment_group_name  row_number
0  Executive General and Administration           1
1                  Inventory Management           1
2                         Manufacturing           1
3                     Quality Assurance           1
4              Research and Development           1
5                   Sales and Marketing           1